In [1]:
import pandas as pd
import numpy as np
from pandas import DataFrame, Series

1. Merging

In [2]:
dframe1 = DataFrame({'Key':['X','Z','Y','X','X','Y'], 'data_1':np.arange(6)})

In [3]:
dframe1

  Key  data_1
0   X       0
1   Z       1
2   Y       2
3   X       3
4   X       4
5   Y       5

In [4]:
dframe2 = DataFrame({'Key':['X','Z','Q'], 'data_2':[1, 2, 3]})

In [5]:
dframe2

  Key  data_2
0   X       1
1   Z       2
2   Q       3

In [6]:
pd.merge(dframe1,dframe2)

  Key  data_1  data_2
0   X       0       1
1   X       3       1
2   X       4       1
3   Z       1       2

In [7]:
pd.merge(dframe1,dframe2,on='Key')

  Key  data_1  data_2
0   X       0       1
1   X       3       1
2   X       4       1
3   Z       1       2

In [8]:
pd.merge(dframe1,dframe2,on='Key',how='left')

  Key  data_1  data_2
0   X       0     1.0
1   Z       1     2.0
2   Y       2     NaN
3   X       3     1.0
4   X       4     1.0
5   Y       5     NaN

In [9]:
pd.merge(dframe1,dframe2,on='Key',how='right')

  Key  data_1  data_2
0   X     0.0       1
1   X     3.0       1
2   X     4.0       1
3   Z     1.0       2
4   Q     NaN       3

In [14]:
df_left = DataFrame({'Key_1':['SF','SF','LA'],
                     'Key_2':['one','two','one'],
                     'left_data':[10, 20, 30]})

In [15]:
df_right = DataFrame({'Key_1':['SF','SF','LA','LA'],
                      'Key_2':['one','one','one','two'],
                      'right_data':[40, 50, 60,70]})

In [16]:
df_left

  Key_1 Key_2  left_data
0    SF   one         10
1    SF   two         20
2    LA   one         30

In [17]:
df_right

  Key_1 Key_2  right_data
0    SF   one          40
1    SF   one          50
2    LA   one          60
3    LA   two          70

In [25]:
pd.merge(df_left,df_right, on=['Key_1', 'Key_2'], how='outer')

  Key_1 Key_2  left_data  right_data
0    SF   one       10.0        40.0
1    SF   one       10.0        50.0
2    SF   two       20.0         NaN
3    LA   one       30.0        60.0
4    LA   two        NaN        70.0

2. Merging on Index

In [28]:
df_left = DataFrame({'key':['X','Y','Z', 'X', 'Y'],
                     'data':[0, 1, 2, 3, 4]})

df_right = DataFrame({'group_data':[10, 20]},index=['X', 'Y'])

In [29]:
pd.merge(df_left, df_right, left_on='key', right_index=True)

  key  data  group_data
0   X     0          10
3   X     3          10
1   Y     1          20
4   Y     4          20

3. Concatenate

In [38]:
arr1 = np.arange(9).reshape(3,3)

In [39]:
arr1

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [42]:
np.concatenate([arr1,arr1])

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [43]:
np.concatenate([arr1,arr1], axis=1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [45]:
data_frame = DataFrame({'col_1': np.arange(5),
                       'col_2': np.random.normal(size=5),
                       'col_3': np.random.normal(size=5)})

In [46]:
data_frame

   col_1     col_2     col_3
0      0 -1.243210  0.263948
1      1 -1.424646  0.389411
2      2 -0.903564  0.083353
3      3 -0.425498 -2.284968
4      4  0.488119 -0.680742

In [47]:
ser = Series(np.random.normal(size=5))

In [48]:
ser

0   -0.337847
1   -0.733393
2    0.316630
3    1.022270
4   -0.629028
dtype: float64

In [49]:
pd.concat([data_frame,ser])

   col_1     col_2     col_3         0
0    0.0 -1.243210  0.263948       NaN
1    1.0 -1.424646  0.389411       NaN
2    2.0 -0.903564  0.083353       NaN
3    3.0 -0.425498 -2.284968       NaN
4    4.0  0.488119 -0.680742       NaN
0    NaN       NaN       NaN -0.337847
1    NaN       NaN       NaN -0.733393
2    NaN       NaN       NaN  0.316630
3    NaN       NaN       NaN  1.022270
4    NaN       NaN       NaN -0.629028

In [50]:
pd.concat([data_frame,ser], axis=1)

   col_1     col_2     col_3         0
0      0 -1.243210  0.263948 -0.337847
1      1 -1.424646  0.389411 -0.733393
2      2 -0.903564  0.083353  0.316630
3      3 -0.425498 -2.284968  1.022270
4      4  0.488119 -0.680742 -0.629028

In [56]:
d1 = DataFrame(np.random.randn(4,3), columns=['A','B','C'])
d2 = DataFrame(np.random.randn(3,3), columns=['A','Z','D'])

In [57]:
d1

          A         B         C
0 -2.200494 -1.997787 -0.158689
1  0.110874 -1.633169  0.030074
2 -0.872067  0.775846 -1.765991
3  1.643400  0.511336 -0.308971

In [58]:
d2

          A         Z         D
0  0.100678  0.452042 -0.342686
1 -0.140400  0.419219  0.601213
2  0.202879 -1.146727  0.405534

In [60]:
pd.concat([d1,d2])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          A         B         C         D         Z
0 -2.200494 -1.997787 -0.158689       NaN       NaN
1  0.110874 -1.633169  0.030074       NaN       NaN
2 -0.872067  0.775846 -1.765991       NaN       NaN
3  1.643400  0.511336 -0.308971       NaN       NaN
0  0.100678       NaN       NaN -0.342686  0.452042
1 -0.140400       NaN       NaN  0.601213  0.419219
2  0.202879       NaN       NaN  0.405534 -1.146727

In [61]:
pd.concat([d1,d2], ignore_index=True)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          A         B         C         D         Z
0 -2.200494 -1.997787 -0.158689       NaN       NaN
1  0.110874 -1.633169  0.030074       NaN       NaN
2 -0.872067  0.775846 -1.765991       NaN       NaN
3  1.643400  0.511336 -0.308971       NaN       NaN
4  0.100678       NaN       NaN -0.342686  0.452042
5 -0.140400       NaN       NaN  0.601213  0.419219
6  0.202879       NaN       NaN  0.405534 -1.146727